#+TITLE ICFP 2012 notes/scratch


* Initial setup
  CLOCK: [2012-07-13 Fri 11:03]--[2012-07-13 Fri 11:59] =>  0:56
  CLOCK: [2012-07-13 Fri 10:53]--[2012-07-13 Fri 10:59] =>  0:06

 - distribution:
   - ./src/ where sourcecode lives
   - ./install
   - ./lifter < map > route
   - ./PACKAGES packages to install
   - ./README

 - use buildapp to produce final executable
 - use quicklisp for bringing in libraries, but plunk them into vendor
   or similar, use an asdf file for loading everything



* Programs

** Library
   CLOCK: [2012-07-13 Fri 11:59]--[2012-07-13 Fri 12:13] =>  0:14

 - reading metadata:
   - read until we've found a robot and a lift.  if no robot or lift,
     complain.
   - first blank line after robot and lift marks start of metadata

default water levels: water 0, flooding 0, waterproof 10

*** STARTED develop model for CA
    CLOCK: [2012-07-13 Fri 21:38]--[2012-07-13 Fri 21:44] =>  0:06
    CLOCK: [2012-07-13 Fri 18:11]--[2012-07-13 Fri 18:47] =>  0:36
     CLOCK: [2012-07-13 Fri 12:13]--[2012-07-13 Fri 16:30] =>  4:17

  - the outer border should never change since there should always be
    walls, so don't bother updating it.

  - model:
    - (m,n) array of values
    - robot position
    - lift position and state
    - lambda positions


 The lift is never open at the start, according to the spec.

 Update map only needs to consider tiles with rocks.

 Maybe we should use bitplanes?  Then you can have fast updates.
  - m x n planes:
    - empty?
    - rock?
    - lambda?

 a robot move can change the rock plane, lambda plane, the earth
 plane, and the empty plane.
 a rock move can only change the rock plane and the empty plane.

if you compute empty at the beginning, you can throw away the earth
plane, because earth = (not empty) & (not rock) & (not lambda) & (not
wall), and earth is not necessary to compute anything.  Actually, this
isn't true; you need earth, but perhaps not wall.  Well, you need one
or the other.

 If it's not empty, it could be a bunch of stuff.


If you pad each row to a power of two, you can do efficient shifting
by implementing your own bignums.  Vertical shifts can just offset the
pointer by the row stride, while horizontal shifts can rotate on the
fly with nearby words.


Logic model:
 1. R and up(E) => down(R), E!
 2. R and up(R) and left(E) and upleft(E) => downright(R), E!
 3. R and up(R) and right(E) and upright(E) => downleft(R), E!
 4. R and up(λ) and left(E) and upleft(E) => downright(R), E!
 5. R => R

R' = R & ~(1 | 2 | 3 | 4) | (1 & down(R)) | ((2|4) & downright(R)) | (3 & downleft(R))

E' = E & R' | (1 | 2 | 3 | 4)


*** STARTED develop model for robot movement
    CLOCK: [2012-07-13 Fri 16:46]--[2012-07-13 Fri 17:19] =>  0:33

P' = P + O
valid when
   E & P'
or earth & P'
or (|O| < 2) & (R&P') & (E& P'+O)

** Simulator
   CLOCK: [2012-07-14 Sat 11:13]--[2012-07-14 Sat 15:15] =>  4:02
   CLOCK: [2012-07-13 Fri 23:16]--[2012-07-14 Sat 01:42] =>  2:26
   CLOCK: [2012-07-13 Fri 22:57]--[2012-07-13 Fri 23:15] =>  0:18

harness might need to eat initial whitespace since we probably can't
deal with it.

 should take map and metadata
 if metadata contains route, compute the route til an ending
 condition, print final map, condition, and points

  - non-graphical: take a map and a move, output resulting map
  - graphical:
    - use tiles
    - forward/back buttons
    - eventually some way to visualize danger by tinting tiles red
    - take route input from program or 
    - show water levels with blue tint

 - return condition (win, lose, abort), number of turns, and lambdas
   collected.

I'm tempted to implement the simulator in J, but maybe python is a
better choice.

** Lifter

 - parent that spawns child
   - first determines parameters of input
   - spawns appropriate lifter based on input size
   - implement a non-consing lifter for huge maps
 - child communicates routes back to parent with estimated value

Plan moves one at a time or as a whole?
One at a time is simple and fast but suboptimal.

Perhaps we should implement a greedy player as a quick test, who at
each tick:
 - moves to the nearest open lift, or nearest lambda if lift is
   unavailable.




** DONE Harness
   - State "DONE"       from ""           [2012-07-13 Fri 22:48]

 - pass map to lifter
 - send SIGINT at 150s
 - send SIGKILL at 160s
  compute points w/simulator

* Strategies
  CLOCK: [2012-07-13 Fri 17:33]--[2012-07-13 Fri 18:11] =>  0:38
  CLOCK: [2012-07-13 Fri 17:19]--[2012-07-13 Fri 17:33] =>  0:14

 - compute as long as possible, keeping a route to emit when we get
   SIGINT.
 - use a parent-child model: the child does the hard stuff, and if it
   dies for any reason, have the parent output whatever it can.
 - always append abort to the route?

 - could we use connected components in planning regions?

 - probably want something like A* for route planning
   - SMA* might be wise
   - can we do something smartly based on the fact that there's only
     about 1G of RAM?

We may be able to winnow the state space with a well-tuned Bloom filter, too.

 - use lookahead in simulator to display danger regions

 - use the fact that the lift only opens if you have all the lambdas
   to consider alternate abort routes

 - one reason to optimize the CA is that the faster we can evaluate
   routes, the more options we can try.

Key to good planning is going to be proper modelling of the risk of
rocks; they basically have a triangular risk projection.

The relationship between earth and empty spaces is key.

Use the PAIP and AIMA source (and books) as references.

Per AIMA, problems consist of:
 - the initial state (map, metadata);
 - operators (robot movement);
 - goal test (at lift or about to be crushed or drowned);
 - path cost function (point value of route).

Also, an admissable heuristic should be monotonic and should be as
high as possible without overestimating.  You can take the maximum of
several admissible heuristics.

I'd say the first one to implement would be manhattan distance from
the robot to nearest lambda through all lambdas to the lift.

The number of lambdas is also a simple heuristic.  No path to the exit
can be shorter than that.

Flooding doesn't really change much, except for pruning many
possibilities.  I guess that if we can make it clear in our search
that certain possibilities become inaccessible as flooding proceeds,
we should be able to handle it.


Observations:
 - the lift only opens if all lambdas are collected.
 - rocks are presently the main hazard
 - there appears to be no penalty for appending A to a route.
 - there may be an opportunity for a peephole optimizer to improve a
   route.
 - it's possible to block oneself from the lift with rocks.
 - it's possible to get a negative score.

 - where the robot is standing presently is actually empty.
 - the state of the lift is implicit in the number of lambdas
   remaining.


 - the math is easier if we reverse y
 - with flooding, lambdas with higher positions become more valuable
   than lower-lying lambdas

One possible heuristic that could be computed early is the route if
rocks are considered empty.  This is somewhat accurate but certainly
an underestimate in the presence of rocks.

In the lifter, why don't we represent state in some way more relevant
to our heuristics, like a fatal bitplane (actually, just mark fatal
states as impassible).



* Research
  CLOCK: [2012-07-14 Sat 09:21]--[2012-07-14 Sat 11:12] =>  1:51
  CLOCK: [2012-07-13 Fri 18:25]--[2012-07-13 Fri 21:37] =>  3:12

 - can we use BDDs for this?
 - what about efficient cellular automata search?
 - D*-lite
 - SetA*

Consider a cluster approach for a heuristic.  Compute connected
components where a component consists of any three or four-way
adjacencies, and edges consist of two-way adjacencies.  Cells with
only one opening are ignored.

I wonder if a BDD could be used in the larger route planning, if each
variable represents getting a lambda, you're trying to satisfy f(x..)
= 1 (get all lambdas) with minimal weight (cost of getting that lambda
from here).

A zero-supressed BDD might be good for representing a function that's
sparse, like rock mapping or similar.

Ok, clearly I don't understand BDDs/ZDDs well enough to implement
them, so back to simpler approaches.


* Lightning Round
  DEADLINE: <2012-07-14 Sat 12:00>


** Getting back on track
   CLOCK: [2012-07-14 Sat 09:13]--[2012-07-14 Sat 09:21] =>  0:08
   CLOCK: [2012-07-13 Fri 21:44]--[2012-07-13 Fri 22:52] =>  1:08

Well, it's safe to say we've been distracted in many ways.  I think
the key for tonight should be getting a harness working and then a
simple lifter at least doing basic A*.

Ok.  What's the simplest possible harness?
 - given a map, execute lifter with map as input
 - set timer, send SIGINT, SIGKILL
 - pass route as output to simulator in score mode
 - read score back from simulator

How about testing the simulator?
 - input contains map and route as metadata
 - output contains final map and score
 - for each in, compare with out (diff -q)


Test suite:
 - simulator against cases plucked from the validator
 - harness against stubborn lifters
   - one does nothing until SIGINT
   - another does nothing until SIGKILL

Some system of evaluating lifters against each other...
Get the harness working first.  The graphical simulator can come after
the lightning round.

 
* Main deadline
  DEADLINE: <2012-07-16 Mon 12:00>
